[
  {
    "id": 1,
    "slug": "100t-comeback-opinion",
    "title": "My Pick ‘Ems are ruined (This is a good thing.)",
    "type": "OPINION",
    "image": "/temp-img.webp",
    "excerpt": "My Pick ‘Ems are ruined (This is a good thing.)",
    "content": "My skin is clear. My crops are flourishing. My Pick ‘Ems are ruined (This is a good thing.).\n\n 100T 1–0 BLGI have to admit, I was a doubter. North America has never won worlds. Some years, our first seed hasn’t even made it out of groups (TSM 0–6 Worlds any% never forget). I try not to cheer for NA teams because I can’t handle the heartbreak. I didn’t watch game 5 of FLY vs GenG last year because I was afraid to watch them lose (They lost ┬┬﹏┬┬). So this year, I told myself I wasn’t gonna get my hopes up.\n\n  But 100Thieves have changed my mind. \n\nFrom 6th to runner-up to LTA 3rd seed, it’s impossible not to get excited for the Thieves. Especially after last night, with 100T Dhokla, Big Dhokes, Mr. D. H. Kola, our North American knight in Sion armour, steamrolling through fights and solo-killing BLG Knight under BLG’s inhibitor turret. (Of course, the rest of the team did well too, but Sion is my third favourite champion. I’m allowed to have my bias.)\n\n The team might be disbanding after this season, but the players living up to the Worlds theme. I have a feeling the Thieves are going to steal a spot in semis and Earn Their Legacy.\n\n Or I’m speaking too soon and they’re not making it out of Swiss. \n\nWho knows? We’ll find out at 4:00 AM EST, when 100T roll TES (✿◠‿◠)",
    "date": "2025-11-03",
    "author": "sweetbutsalty"
  }, 
  {
    "id": 2,
    "slug": "bdd-road-opinion",
    "title": "Through The Bdd Road",
    "type": "OPINION",
    "image": "/temp-img.webp",
    "excerpt": "Through The Bdd Road",
    "content": "It’s 2017 LCK Summer and Incredible Miracle have vanished, in their place, the blue dragon comes to life, Longzhu Gaming rises from the ashes of the first. This roster brings the bot-lane from a mythic ROX Tigers, Khan from years in LPL, the newcomers Rascal and Cuzz and the player that would stand out most between them, Bdd. They are instantly the best team in Korea at the moment.\n\n These players come to the Worlds Stage with all the hype they deserve from winning LCK over the past champions SKT. But soon they will fall short as Samsung Galaxy beat them 3-0 in the quarterfinals. The summer dream comes to an end, the crown being taken from their hands.\n\n  The next year one more Tiger is added to the roster replacing Cuzz, Peanut enters and they smash 2018 LCK Spring. But, again, don’t get any international results as RNG take them down on MSI 2018 finals. Bdd isn’t able to take the crown to himself a second time, in the next year the midlaner have a year of no results with KT, and, finally, in 2020, he comes back to being a title contender in GENG.\n\n Alongside Ruler, Bdd for three years tried  to be a World Champion. GENG roster always reaching playoffs at the biggest stage of the year, but never really living up to the expectations. Bdd is the type of player that you can see as a “LoL Harry Kane”, too good to never achieve the biggest honor. Them, after GENG, he had some ups and downs, go to Nongshim Redforce for a brief period of time and then KT Rolster.\n\n Bdd seems to have some kind of unlucky career, sometimes surrounded by stars, sometimes by middle table players, always in some kind of mess, be it good or not. The thing is, was always a consistent player and arguably one of the best midlaners LCK have ever produced. In 2025 Worlds, alongside with his old partner, Cuzz and the rookie Peter, after a surprising run as Korea 4th seed, beating GENG in the semifinals, this may be the time the unlucky get something, may be there that the crown go to the hands of the one that tried all that time, but was never in the right place, never in the right time.",
    "date": "2025-11-06",
    "author": "minmin"
  }

]

